In [8]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
hop = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(hop)

In [201]:
total_players = len(purchase_data["SN"].unique())

In [10]:
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Players":[total_players]})
summary_df

   Number of Players
0                576

In [223]:
total_purchases = purchase_data["Item ID"].count()
# Calculate the number of unique authors in the DataFrame
itemname = len(purchase_data["Item Name"].unique())
# The mean method averages the series
average = purchase_data["Price"].mean()
# The sum method adds every entry in the series
total = purchase_data["Price"].sum()
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Unique Items": [itemname],
                           "Average Price": [average],
                           "Total Purchases":[total_purchases],
                           "Total Revenue": [total]})
summary_df

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                     179       3.050987              780        2379.77

In [206]:
uni_sn=purchase_data.drop_duplicates(subset=["SN"],keep = "last")

In [255]:
gcount = total_players
malec =  uni_sn["Gender"].value_counts()["Male"]
femalec = uni_sn["Gender"].value_counts()["Female"]
otherc = uni_sn["Gender"].value_counts()["Other / Non-Disclosed"]

summary_df = pd.DataFrame({"Total Male": [malec],
                           "Total Female": [femalec],
                           "Total Other/Non-Disclosed":[otherc],
                           "Total Players": [gcount]})

In [259]:
genderpc_df= pd.DataFrame([{"Player Type": "Male", "Total Count": malec},
                            {"Player Type": "Female", "Total Count": femalec},
                            {"Player Type": "Other/Non-Disclosed", "Total Count":otherc}])

In [262]:
total_players = genderpc_df["Total Count"].sum()

In [261]:
# Create a new column that finds the Total Male Percentages
genderpc_df["Percentage of Players"] = genderpc_df["Total Count"] / total_players
genderpc_df

           Player Type  Total Count  Percentage of Players
0                 Male          484               0.840278
1               Female           81               0.140625
2  Other/Non-Disclosed           11               0.019097

In [251]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= purchase_data.groupby("Gender").agg({"Price":["sum","mean","max","min"]})

In [247]:
tmale=purchase_data["Gender"].value_counts()["Male"]
tfemale=purchase_data["Gender"].value_counts()["Female"]
tother=purchase_data["Gender"].value_counts()["Other / Non-Disclosed"]

In [252]:
matp=4.99
fatp=4.90
oatp=4.75
pur_cm=tmale
price_summ=1967.64
avgmp=price_summ/pur_cm
pur_cf=tfemale
price_sumf=361.94
avgfp=price_sumf/pur_cf
pur_co=tother
price_sumo=50.19
avgop=price_sumo/pur_co

In [253]:
summarybygender_df = pd.DataFrame([{"Gender": "Male", "Total Count": pur_cm,"Average Purchase Price":avgmp,"Total Purchase Value":price_summ,"Avg Total Purchase Per Person":matp},
                            {"Gender": "Female", "Total Count": pur_cf,"Average Purchase Price":avgfp,"Total Purchase Value":price_sumf,"Avg Total Purchase Per Person":fatp},
                            {"Gender": "Other/Non-Disclosed", "Total Count":pur_co,"Average Purchase Price":avgop,"Total Purchase Value":price_sumo,"Avg Total Purchase Per Person":oatp}])
summarybygender_df

,Gender,Total Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
0,Male,652,3.017853,1967.64,4.99
1,Female,113,3.203009,361.94,4.90
2,Other/Non-Disclosed,15,3.346000,50.19,4.75

In [226]:
# Read and display the CSV with Pandas
hop_df = purchase_data

In [227]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= hop_df.groupby("Gender").agg({"Age":["mean","max","min"]})

In [42]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
bins = [9,10,15,20,24,25,30,35,40]

# Create the names for the five bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [263]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], bins, labels=group_labels).head()

0    15-19
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [233]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], bins, labels=group_labels)
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")
# Find how many rows fall into each bin
c=(age_group["Age"].count())
# Find how many rows fall into each bin
p=(age_group["Age"].count()/780)

In [234]:
agedemo_df = pd.DataFrame({"Total Count":c,"Total Percentages":p*100})

agedemo_df

           Total Count  Total Percentages
Age Group
<10                  9           1.153846
10-14               54           6.923077
15-19              200          25.641026
20-24              266          34.102564
25-29               59           7.564103
30-34               77           9.871795
35-39               52           6.666667
40+                 33           4.230769

In [199]:
# Create a GroupBy object based upon "Age Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
atp=(age_group["Age"].count())

# Get the average of each column within the GroupBy object
psum=age_group[["Price"]].sum()

# Get the average of each column within the GroupBy object
pavg=age_group[["Price"]].mean()

In [48]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
pbins = [0, 10, 15, 20, 25, 30,35,40,45]

# Create the names for the five bins
group_cat = ["<=10", "11-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [49]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], pbins, labels=group_cat).head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<=10' < '11-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [198]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)

In [196]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)

In [200]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
a=(age_group["Age"].count())

# Find how many rows fall into each bin
admean=(age_group["Price"].mean())

# Find how many rows fall into each bin
d=(age_group["Price"].sum())

In [53]:
agedemo_df = pd.DataFrame({"Purchase Count":a,"Average Purchase Price":admean,"Total Purchase Value":d})

agedemo_df

           Total Count  Average Total Price  Total Purchase Value
Age Group
<=10                32             3.405000                108.96
11-14               54             2.900000                156.60
15-19              200             3.107800                621.56
20-24              325             3.020431                981.64
25-29               77             2.875584                221.42
30-34               52             2.994423                155.71
35-39               33             3.404545                112.35
40+                  7             3.075714                 21.53

In [264]:
df = hop_df.sort_values(["SN"])
df["SN"].count()

780

In [56]:
df.groupby(['SN']).count()

               Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Group
SN
Adairialis76             1    1       1        1          1      1          1
Adastirin33              1    1       1        1          1      1          1
Aeda94                   1    1       1        1          1      1          1
Aela59                   1    1       1        1          1      1          1
Aelaria33                1    1       1        1          1      1          1
...                    ...  ...     ...      ...        ...    ...        ...
Yathecal82               3    3       3        3          3      3          3
Yathedeu43               2    2       2        2          2      2          2
Yoishirrala98            1    1       1        1          1      1          1
Zhisrisu83               2    2       2        2          2      2          2
Zontibe81                3    3       3        3          3      3          3

[576 rows x 7 columns]

In [192]:
df.groupby(["SN","Price"]).count()

                    Purchase ID  Age  Gender  Item ID  Item Name  Age Group
SN           Price
Adairialis76 2.28             1    1       1        1          1          1
Adastirin33  4.48             1    1       1        1          1          1
Aeda94       4.91             1    1       1        1          1          1
Aela59       4.32             1    1       1        1          1          1
Aelaria33    1.79             1    1       1        1          1          1
...                         ...  ...     ...      ...        ...        ...
Zhisrisu83   3.54             1    1       1        1          1          1
             4.35             1    1       1        1          1          1
Zontibe81    1.76             1    1       1        1          1          1
             2.48             1    1       1        1          1          1
             3.79             1    1       1        1          1          1

[779 rows x 6 columns]

In [193]:
total=df.groupby(['SN'])["Price"].sum()
average = df.groupby(['SN'])["Price"].mean()
count_data =df.groupby(['SN'])["Price"].count()
user_df= pd.DataFrame({"Purchase Count":count_data,"Average":average,"Total Purchase Value":total})
sorted_df=user_df.sort_values("Purchase Count",ascending=False)
sorted_df.head()

             Purchase Count   Average  Total Purchase Value
SN
Lisosia93                 5  3.792000                 18.96
Iral74                    4  3.405000                 13.62
Idastidru52               4  3.862500                 15.45
Asur53                    3  2.480000                  7.44
Inguron55                 3  3.703333                 11.11

In [191]:
Nameitemid=hop_df.groupby(["Item ID"]).count()

In [190]:
item_data = df.loc[:,["Item ID", "Item Name", "Price"]]

In [188]:
item_data.groupby(['Item ID', 'Item Name']).size()
Id_item=item_data.groupby(['Item ID', 'Item Name'])['Price'].count()
Id_mean=item_data.groupby(['Item ID', 'Item Name'])['Price'].mean()
Id_sum=item_data.groupby(['Item ID', 'Item Name'])['Price'].sum()

In [189]:
# Creating a new DataFrame using both duration and count
popsum_df = pd.DataFrame({"Purchase Count": Id_item,"Item Price": Id_mean,"Total Purchase Value":Id_sum})
sorted_df=popsum_df.sort_values("Purchase Count",ascending=False)
sorted_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [183]:
totp_sorted_df=popsum_df.sort_values("Total Purchase Value",ascending=False)
totp_sorted_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80